HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xb/IfxSent_regdef.h
/** \\brief  Interrupt Status Register */
typedef struct _Ifx_SENT_CH_INTSTAT_Bits
{
    unsigned int RSI:1;                     /**< \brief [0:0] Receive Success Interrupt Request Flag (rh) */
    unsigned int RDI:1;                     /**< \brief [1:1] Receive Data Interrupt Request Flag (rh) */
    unsigned int RBI:1;                     /**< \brief [2:2] Receive Buffer Overflow Interrupt Request Flag (rh) */
    unsigned int TDI:1;                     /**< \brief [3:3] Transfer Data Interrupt Request Flag (rh) */
    unsigned int TBI:1;                     /**< \brief [4:4] Transmit Buffer Underflow Interrupt Request Flag (rh) */
    unsigned int FRI:1;                     /**< \brief [5:5] Frequency Range Interrupt Request Flag (rh) */
    unsigned int FDI:1;                     /**< \brief [6:6] Frequency Drift Interrupt Request Flag (rh) */
    unsigned int NNI:1;                     /**< \brief [7:7] Number of Nibbles Wrong Request Flag (rh) */
    unsigned int NVI:1;                     /**< \brief [8:8] Nibbles Value out of Range Request Flag (rh) */
    unsigned int CRCI:1;                    /**< \brief [9:9] CRC Error Request Flag (rh) */
    unsigned int WSI:1;                     /**< \brief [10:10] Wrong Status and Communication Nibble Error Request Flag (rh) */
    unsigned int SDI:1;                     /**< \brief [11:11] Serial Data Receive Interrupt Request Flag (rh) */
    unsigned int SCRI:1;                    /**< \brief [12:12] Serial Data CRC Error Request Flag (rh) */
    unsigned int WDI:1;                     /**< \brief [13:13] Watch Dog Error Request Flag (rh) */
    unsigned int reserved_14:18;            /**< \brief \internal Reserved */
} Ifx_SENT_CH_INTSTAT_Bits;

/** \\brief  Input and Output Control Register */
typedef struct _Ifx_SENT_CH_IOCR_Bits
{
    unsigned int ALTI:2;                    /**< \brief [1:0] Alternate Input Select (rw) */
    unsigned int reserved_2:2;              /**< \brief \internal Reserved */
    unsigned int DEPTH:4;                   /**< \brief [7:4] Digital Glitch Filter Depth (rw) */
    unsigned int OIE:1;                     /**< \brief [8:8] Output Inverter Enable Channel x (rw) */
    unsigned int IIE:1;                     /**< \brief [9:9] Input Inverter Enable Channel x (rw) */
    unsigned int CEC:1;                     /**< \brief [10:10] Clear Edge Counter (w) */
    unsigned int reserved_11:1;             /**< \brief \internal Reserved */
    unsigned int REG:1;                     /**< \brief [12:12] Rising Edge Glitch Flag for Channel x (rh) */
    unsigned int FEG:1;                     /**< \brief [13:13] Falling Edge Glitch Flag for Channel x (rh) */
    unsigned int CREG:1;                    /**< \brief [14:14] Clear Rising Edge Glitch Flag for Channel x (rw) */
    unsigned int CFEG:1;                    /**< \brief [15:15] Clear Falling Edge Glitch Flag for Channel x (rw) */
    unsigned int ETS:4;                     /**< \brief [19:16] External Trigger Select (rw) */
    unsigned int EC:8;                      /**< \brief [27:20] Edge Counter (rh) */
    unsigned int CTR:1;                     /**< \brief [28:28] Clear Trigger Monitor Flag for Channel x (rw) */
    unsigned int TRM:1;                     /**< \brief [29:29] Trigger Monitor Flag for Channel x (rh) */
    unsigned int RXM:1;                     /**< \brief [30:30] Receive Monitor for Channel x (rh) */
    unsigned int TXM:1;                     /**< \brief [31:31] Transmit Monitor for Channel x (rh) */
} Ifx_SENT_CH_IOCR_Bits;

/** \\brief  Receiver Control Register */
typedef struct _Ifx_SENT_CH_RCR_Bits
{
    unsigned int CEN:1;                     /**< \brief [0:0] Channel Enable (rw) */
    unsigned int IEP:1;                     /**< \brief [1:1] Ignore End Pulse (rw) */
    unsigned int ACE:1;                     /**< \brief [2:2] Alternative CRC Mode Enable (rw) */
    unsigned int SNI:1;                     /**< \brief [3:3] Status Nibble Included in CRC (rw) */
    unsigned int SDP:1;                     /**< \brief [4:4] Serial Data Processing Mode (rw) */
    unsigned int SCDIS:1;                   /**< \brief [5:5] CRC for Serial Data Disabled Mode (rw) */
    unsigned int CDIS:1;                    /**< \brief [6:6] CRC Disabled Mode (rw) */
    unsigned int CFC:1;                     /**< \brief [7:7] Consecutive Frame Check (rw) */
    unsigned int FRL:8;                     /**< \brief [15:8] Frame Length (rw) */
    unsigned int CRZ:1;                     /**< \brief [16:16] CRC with Zero Nibble for Serial Data (rw) */
    unsigned int ESF:1;                     /**< \brief [17:17] Extended Serial Frame Mode (rw) */
    unsigned int IDE:1;                     /**< \brief [18:18] Ignore Drift Error Mode (rw) */
    unsigned int SUSEN:1;                   /**< \brief [19:19] Suspend Enable (rw) */
    unsigned int reserved_20:12;            /**< \brief \internal Reserved */
} Ifx_SENT_CH_RCR_Bits;

/** \\brief  Receive Status Register */
typedef struct _Ifx_SENT_CH_RSR_Bits
{
    unsigned int CRC:4;                     /**< \brief [3:0] CRC (r) */
    unsigned int CST:2;                     /**< \brief [5:4] Channel Status (r) */
    unsigned int reserved_6:2;              /**< \brief \internal Reserved */
    unsigned int SCN:4;                     /**< \brief [11:8] Status and Communication Nibble (r) */
    unsigned int reserved_12:20;            /**< \brief \internal Reserved */
} Ifx_SENT_CH_RSR_Bits;

/** \\brief  SPC Control Register */
typedef struct _Ifx_SENT_CH_SCR_Bits
{
    unsigned int PLEN:6;                    /**< \brief [5:0] Pulse Length (rw) */
    unsigned int TRIG:2;                    /**< \brief [7:6] Trigger Source and Mode Selection (rw) */
    unsigned int DEL:6;                     /**< \brief [13:8] Delay Length (rw) */
    unsigned int BASE:1;                    /**< \brief [14:14] Time Base (rw) */
    unsigned int TRQ:1;                     /**< \brief [15:15] Transfer Request in Progress (r) */
    unsigned int reserved_16:16;            /**< \brief \internal Reserved */
} Ifx_SENT_CH_SCR_Bits;

/** \\brief  Serial Data and Status Register */
typedef struct _Ifx_SENT_CH_SDS_Bits
{
    unsigned int SD:16;                     /**< \brief [15:0] Serial Data (r) */
    unsigned int MID:8;                     /**< \brief [23:16] Message ID (r) */
    unsigned int SCRC:6;                    /**< \brief [29:24] SCRC (r) */
    unsigned int reserved_30:1;             /**< \brief \internal Reserved */
    unsigned int CON:1;                     /**< \brief [31:31] Configuration bit (r) */
} Ifx_SENT_CH_SDS_Bits;

/** \\brief  Receive Data View Register */
typedef struct _Ifx_SENT_CH_VIEW_Bits
{
    unsigned int RDNP0:3;                   /**< \brief [2:0] Receive Data Target Nibble Pointer 0 (rw) */
    unsigned int reserved_3:1;              /**< \brief \internal Reserved */
    unsigned int RDNP1:3;                   /**< \brief [6:4] Receive Data Target Nibble Pointer 1 (rw) */
    unsigned int reserved_7:1;              /**< \brief \internal Reserved */
    unsigned int RDNP2:3;                   /**< \brief [10:8] Receive Data Target Nibble Pointer 2 (rw) */
    unsigned int reserved_11:1;             /**< \brief \internal Reserved */
    unsigned int RDNP3:3;                   /**< \brief [14:12] Receive Data Target Nibble Pointer 3 (rw) */
    unsigned int reserved_15:1;             /**< \brief \internal Reserved */
    unsigned int RDNP4:3;                   /**< \brief [18:16] Receive Data Target Nibble Pointer 4 (rw) */
    unsigned int reserved_19:1;             /**< \brief \internal Reserved */
    unsigned int RDNP5:3;                   /**< \brief [22:20] Receive Data Target Nibble Pointer 5 (rw) */
    unsigned int reserved_23:1;             /**< \brief \internal Reserved */
    unsigned int RDNP6:3;                   /**< \brief [26:24] Receive Data Target Nibble Pointer 6 (rw) */
    unsigned int reserved_27:1;             /**< \brief \internal Reserved */
    unsigned int RDNP7:3;                   /**< \brief [30:28] Receive Data Target Nibble Pointer 7 (rw) */
    unsigned int reserved_31:1;             /**< \brief \internal Reserved */
} Ifx_SENT_CH_VIEW_Bits;

/** \\brief  Watch Dog Timer Register */
typedef struct _Ifx_SENT_CH_WDT_Bits
{
    unsigned int WDLx:16;                   /**< \brief [15:0] Watch Dog Timer Limit (rw) */
    unsigned int reserved_16:16;            /**< \brief \internal Reserved */
} Ifx_SENT_CH_WDT_Bits;

/** \\brief  Clock Control Register */
typedef struct _Ifx_SENT_CLC_Bits
{
    unsigned int DISR:1;                    /**< \brief [0:0] Module Disable Request Bit (rw) */
    unsigned int DISS:1;                    /**< \brief [1:1] Module Disable Status Bit (rh) */
    unsigned int reserved_2:1;              /**< \brief \internal Reserved */
    unsigned int EDIS:1;                    /**< \brief [3:3] Sleep Mode Enable Control (rw) */
    unsigned int reserved_4:4;              /**< \brief \internal Reserved */
    unsigned int RMC:8;                     /**< \brief [15:8] 8-bit Clock Divider Value in RUN Mode (rw) */
    unsigned int reserved_16:16;            /**< \brief \internal Reserved */
} Ifx_SENT_CLC_Bits;

/** \\brief  SENT Fractional Divider Register */
typedef struct _Ifx_SENT_FDR_Bits
{
    unsigned int STEP:10;                   /**< \brief [9:0] Step Value (rw) */
    unsigned int reserved_10:4;             /**< \brief \internal Reserved */
    unsigned int DM:2;                      /**< \brief [15:14] Divider Mode (rw) */
    unsigned int RESULT:10;                 /**< \brief [25:16] Result Value (rh) */
    unsigned int reserved_26:6;             /**< \brief \internal Reserved */
} Ifx_SENT_FDR_Bits;

/** \\brief  Module Identification Register */
typedef struct _Ifx_SENT_ID_Bits
{
    unsigned int MODREV:8;                  /**< \brief [7:0] Module Revision Number (r) */
    unsigned int MODTYPE:8;                 /**< \brief [15:8] Module Type (r) */
    unsigned int MODNUMBER:16;              /**< \brief [31:16] Module Number Value (r) */
} Ifx_SENT_ID_Bits;

/** \\brief  Interrupt Overview Register */
typedef struct _Ifx_SENT_INTOV_Bits
{
    unsigned int IPC0:1;                    /**< \brief [0:0] Interrupt Pending on Channel 0 (rh) */
    unsigned int IPC1:1;                    /**< \brief [1:1] Interrupt Pending on Channel 1 (rh) */
    unsigned int IPC2:1;                    /**< \brief [2:2] Interrupt Pending on Channel 2 (rh) */
    unsigned int IPC3:1;                    /**< \brief [3:3] Interrupt Pending on Channel 3 (rh) */
    unsigned int IPC4:1;                    /**< \brief [4:4] Interrupt Pending on Channel 4 (rh) */
    unsigned int IPC5:1;                    /**< \brief [5:5] Interrupt Pending on Channel 5 (rh) */
    unsigned int IPC6:1;                    /**< \brief [6:6] Interrupt Pending on Channel 6 (rh) */
    unsigned int IPC7:1;                    /**< \brief [7:7] Interrupt Pending on Channel 7 (rh) */
    unsigned int IPC8:1;                    /**< \brief [8:8] Interrupt Pending on Channel 8 (rh) */
    unsigned int IPC9:1;                    /**< \brief [9:9] Interrupt Pending on Channel 9 (rh) */
    unsigned int reserved_10:22;            /**< \brief \internal Reserved */
} Ifx_SENT_INTOV_Bits;

/** \\brief  Kernel Reset Register 0 */
typedef struct _Ifx_SENT_KRST0_Bits
{
    unsigned int RST:1;                     /**< \brief [0:0] Kernel Reset (rwh) */
    unsigned int RSTSTAT:1;                 /**< \brief [1:1] Kernel Reset Status (rh) */
    unsigned int reserved_2:30;             /**< \brief \internal Reserved */
} Ifx_SENT_KRST0_Bits;

/** \\brief  Kernel Reset Register 1 */
typedef struct _Ifx_SENT_KRST1_Bits
{
    unsigned int RST:1;                     /**< \brief [0:0] Kernel Reset (rwh) */
    unsigned int reserved_1:31;             /**< \brief \internal Reserved */
} Ifx_SENT_KRST1_Bits;

/** \\brief  Kernel Reset Status Clear Register */
typedef struct _Ifx_SENT_KRSTCLR_Bits
{
    unsigned int CLR:1;                     /**< \brief [0:0] Kernel Reset Status Clear (w) */
    unsigned int reserved_1:31;             /**< \brief \internal Reserved */
} Ifx_SENT_KRSTCLR_Bits;

